import { TimerReset, Scale, Target, MoveRight, Layers, Columns3 } from "lucide-react";

export const VARIANT_DATA_INFO = {

  "unconstrained-prog": {
    title: "تست بدون محدودیت (صعودی)",
    sub: "۳ تا ۵ دیسک، ۲۴ مرحله افزایشی",
    rules: [
      {
        title: "حرکت تک مهره‌ای",
        description: "در هر مرحله فقط یک مهره می‌تواند حرکت کند.",
        icon: MoveRight,
      },
      {
        title: "مهره‌های قابل حرکت",
        description: "تنها مهره‌هایی که در بالای میله قرار دارند قابل جابه‌جایی هستند.",
        icon: Layers,
      },
      {
        title: "عدم محدودیت ظرفیت میله‌ها",
        description: "می‌توانید هر تعداد مهره که می‌خواهید را روی یک میله قرار دهید.",
        icon: Scale
      },
      {
        title: "هدف رسیدن به پاسخ بهینه است",
        description: "بهترین عملکرد زمانی به دست می‌آید که مسئله با حداقل حرکت  ممکن حل شود.",
        icon: Target
      }
    ]
  },

  "unconstrained-rand": {
    title: "تست بدون محدودیت (تصادفی)",
    sub: "۳ تا ۵ دیسک، ۲۴ مسئله تصادفی",
    rules: [
      {
        title: "حرکت تک مهره‌ای",
        description: "در هر مرحله فقط یک مهره می‌تواند حرکت کند.",
        icon: MoveRight,
      },
      {
        title: "مهره‌های قابل حرکت",
        description: "تنها مهره‌هایی که در بالای میله قرار دارند قابل جابه‌جایی هستند.",
        icon: Layers,
      },
      {
        title: "عدم محدودیت ظرفیت میله‌ها",
        description: "می‌توانید هر تعداد مهره که می‌خواهید را روی یک میله قرار دهید.",
        icon: Scale
      },
      {
        title: "هدف رسیدن به پاسخ بهینه است",
        description: "بهترین عملکرد زمانی به دست می‌آید که مسئله با حداقل حرکت  ممکن حل شود.",
        icon: Target
      }
    ]
  },

  "shallice-classic": {
    title: "آزمون شالیس (کلاسیک)",
    sub: "۳ دیسک، ۱۲ مسئله استاندارد شالیس",
    rules: [
      {
        title: "حرکت تک مهره‌ای",
        description: "در هر مرحله فقط یک مهره می‌تواند حرکت کند.",
        icon: MoveRight,
      },
      {
        title: "مهره‌های قابل حرکت",
        description: "تنها مهره‌هایی که در بالای میله قرار دارند قابل جابه‌جایی هستند.",
        icon: Layers,
      },
      {
        title: "محدودیت ظرفیت میله‌ها",
        description: "هر میله ظرفیت مشخصی برای مهره‌ها دارد.",
        icon: Columns3
      },
      {
        title: "هدف رسیدن به پاسخ بهینه است",
        description: "بهترین عملکرد زمانی به دست می‌آید که مسئله با حداقل حرکت  ممکن حل شود.",
        icon: Target
      }
    ]
  },

  "shallice-random": {
    title: "آزمون شالیس (تصادفی)",
    sub: "۳ دیسک، ۳۰ مسئله تصادفی با محدودیت شالیس",
    rules: [
      {
        title: "حرکت تک مهره‌ای",
        description: "در هر مرحله فقط یک مهره می‌تواند حرکت کند.",
        icon: MoveRight,
      },
      {
        title: "مهره‌های قابل حرکت",
        description: "تنها مهره‌هایی که در بالای میله قرار دارند قابل جابه‌جایی هستند.",
        icon: Layers,
      },
      {
        title: "محدودیت ظرفیت میله‌ها",
        description: "هر میله ظرفیت مشخصی برای مهره‌ها دارد.",
        icon: Columns3
      },
      {
        title: "هدف رسیدن به پاسخ بهینه است",
        description: "بهترین عملکرد زمانی به دست می‌آید که مسئله با حداقل حرکت  ممکن حل شود.",
        icon: Target
      }
    ]
  },

  "phillips-a": {
    title: "آزمون فیلیپس - سری A",
    sub: "۵ دیسک، ۸ مرحله با دشواری فزاینده",
    rules: [
      {
        title: "حرکت تک مهره‌ای",
        description: "در هر مرحله فقط یک مهره می‌تواند حرکت کند.",
        icon: MoveRight,
      },
      {
        title: "مهره‌های قابل حرکت",
        description: "تنها مهره‌هایی که در بالای میله قرار دارند قابل جابه‌جایی هستند.",
        icon: Layers,
      },
      {
        title: "عدم محدودیت ظرفیت میله‌ها",
        description: "می‌توانید هر تعداد مهره که می‌خواهید را روی یک میله قرار دهید.",
        icon: Scale
      },
      {
        title: "هدف رسیدن به پاسخ بهینه است",
        description: "بهترین عملکرد زمانی به دست می‌آید که مسئله با حداقل حرکت  ممکن حل شود.",
        icon: Target
      }
    ]
  },

  "phillips-b": {
    title: "آزمون فیلیپس - سری B",
    sub: "۵ دیسک، ۸ مرحله با دشواری فزاینده",
    rules: [
      {
        title: "حرکت تک مهره‌ای",
        description: "در هر مرحله فقط یک مهره می‌تواند حرکت کند.",
        icon: MoveRight,
      },
      {
        title: "مهره‌های قابل حرکت",
        description: "تنها مهره‌هایی که در بالای میله قرار دارند قابل جابه‌جایی هستند.",
        icon: Layers,
      },
      {
        title: "عدم محدودیت ظرفیت میله‌ها",
        description: "می‌توانید هر تعداد مهره که می‌خواهید را روی یک میله قرار دهید.",
        icon: Scale
      },
      {
        title: "هدف رسیدن به پاسخ بهینه است",
        description: "بهترین عملکرد زمانی به دست می‌آید که مسئله با حداقل حرکت  ممکن حل شود.",
        icon: Target
      }
    ]
  },

  "phillips-c": {
    title: "آزمون فیلیپس - سری C",
    sub: "۵ دیسک، ۸ مرحله با دشواری فزاینده",
    rules: [
      {
        title: "حرکت تک مهره‌ای",
        description: "در هر مرحله فقط یک مهره می‌تواند حرکت کند.",
        icon: MoveRight,
      },
      {
        title: "مهره‌های قابل حرکت",
        description: "تنها مهره‌هایی که در بالای میله قرار دارند قابل جابه‌جایی هستند.",
        icon: Layers,
      },
      {
        title: "عدم محدودیت ظرفیت میله‌ها",
        description: "می‌توانید هر تعداد مهره که می‌خواهید را روی یک میله قرار دهید.",
        icon: Scale
      },
      {
        title: "هدف رسیدن به پاسخ بهینه است",
        description: "بهترین عملکرد زمانی به دست می‌آید که مسئله با حداقل حرکت  ممکن حل شود.",
        icon: Target
      }
    ]
  },

  "fimbel-old": {
    title: "آزمون فیمبل (سالمندان)",
    sub: "۳ دیسک، ۱۵ مرحله تخصصی",
    rules: [
      {
        title: "حرکت تک مهره‌ای",
        description: "در هر مرحله فقط یک مهره می‌تواند حرکت کند.",
        icon: MoveRight,
      },
      {
        title: "مهره‌های قابل حرکت",
        description: "تنها مهره‌هایی که در بالای میله قرار دارند قابل جابه‌جایی هستند.",
        icon: Layers,
      },
      {
        title: "محدودیت ظرفیت میله‌ها",
        description: "هر میله ظرفیت مشخصی برای مهره‌ها دارد.",
        icon: Columns3
      },
      {
        title: "هدف رسیدن به پاسخ بهینه است",
        description: "بهترین عملکرد زمانی به دست می‌آید که مسئله با حداقل حرکت  ممکن حل شود.",
        icon: Target
      }
    ]
  },

  "fimbel-young": {
    title: "آزمون فیمبل (جوانان)",
    sub: "۳ دیسک، ۳۵ مرحله تخصصی",
    rules: [
      {
        title: "حرکت تک مهره‌ای",
        description: "در هر مرحله فقط یک مهره می‌تواند حرکت کند.",
        icon: MoveRight,
      },
      {
        title: "مهره‌های قابل حرکت",
        description: "تنها مهره‌هایی که در بالای میله قرار دارند قابل جابه‌جایی هستند.",
        icon: Layers,
      },
      {
        title: "محدودیت ظرفیت میله‌ها",
        description: "هر میله ظرفیت مشخصی برای مهره‌ها دارد.",
        icon: Columns3
      },
      {
        title: "هدف رسیدن به پاسخ بهینه است",
        description: "بهترین عملکرد زمانی به دست می‌آید که مسئله با حداقل حرکت  ممکن حل شود.",
        icon: Target
      }
    ]
  },

  "tol-r": {
    title: "آزمون TOL‑R",
    sub: "۳ دیسک، ۳۰ مسئله با محدودیت زمان",
    rules : [
  {
    title: "حرکت تک مهره‌ای",
    description: "در هر مرحله فقط یک مهره می‌تواند حرکت کند.",
    icon: MoveRight,
  },
  {
    title: "مهره‌های قابل حرکت",
    description: "تنها مهره‌هایی که در بالای میله قرار دارند قابل جابه‌جایی هستند.",
    icon: Layers,
  },
  {
    title: "محدودیت ظرفیت میله‌ها",
    description: "هر میله ظرفیت مشخصی دارد.",
    icon: Columns3,
  },
  {
    title: "محدودیت زمان و حرکت",
    description: "هر مرحله دارای محدودیت زمانی و تعداد حرکات است.",
    icon: TimerReset,
  },
    ]
  },

  "tol-dx": {
    title: "آزمون TOL‑DX",
    sub: "۳ دیسک، ۱۵ مسئله استاندارد کلبرتسون",
    rules: [
      {
        title: "حرکت تک مهره‌ای",
        description: "در هر مرحله فقط یک مهره می‌تواند حرکت کند.",
        icon: MoveRight,
      },
      {
        title: "مهره‌های قابل حرکت",
        description: "تنها مهره‌هایی که در بالای میله قرار دارند قابل جابه‌جایی هستند.",
        icon: Layers,
      },
      {
        title: "محدودیت ظرفیت میله‌ها",
        description: "هر میله ظرفیت مشخصی برای مهره‌ها دارد.",
        icon: Columns3
      },
      {
        title: "هدف رسیدن به پاسخ بهینه است",
        description: "بهترین عملکرد زمانی به دست می‌آید که مسئله با حداقل حرکت  ممکن حل شود.",
        icon: Target
      }
    ]
  }
};
